{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Convolution2D", "config": {"W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "batch_input_shape": [null, 64, 64, 3], "nb_filter": 32, "input_dtype": "float32", "name": "convolution2d_1", "nb_row": 5, "b_constraint": null, "dim_ordering": "tf", "activation": "linear", "nb_col": 5, "border_mode": "same", "subsample": [2, 2], "trainable": true, "bias": true, "init": "glorot_uniform", "W_constraint": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_1", "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "nb_filter": 16, "name": "convolution2d_2", "nb_row": 3, "b_constraint": null, "dim_ordering": "tf", "activation": "linear", "nb_col": 3, "border_mode": "valid", "subsample": [1, 1], "trainable": true, "bias": true, "init": "glorot_uniform", "W_constraint": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_2", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.4, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "pool_size": [2, 2], "trainable": true, "name": "maxpooling2d_1", "strides": [2, 2], "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "nb_filter": 16, "name": "convolution2d_3", "nb_row": 3, "b_constraint": null, "dim_ordering": "tf", "activation": "linear", "nb_col": 3, "border_mode": "valid", "subsample": [1, 1], "trainable": true, "bias": true, "init": "glorot_uniform", "W_constraint": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_3", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.4, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "output_dim": 1024, "name": "dense_1", "bias": true, "activation": "linear", "b_constraint": null, "trainable": true, "input_dim": 2704, "init": "glorot_uniform", "W_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "p": 0.3, "trainable": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_4", "trainable": true}}, {"class_name": "Dense", "config": {"W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "output_dim": 512, "name": "dense_2", "bias": true, "activation": "linear", "b_constraint": null, "trainable": true, "input_dim": 1024, "init": "glorot_uniform", "W_constraint": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_5", "trainable": true}}, {"class_name": "Dense", "config": {"W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "output_dim": 1, "name": "dense_3", "bias": true, "activation": "linear", "b_constraint": null, "trainable": true, "input_dim": 512, "init": "glorot_uniform", "W_constraint": null}}]}